import random

trevelers = 0
mountin = 0
my_team = 0

print("Вітаю в моїй історії")

# ----start------
print("Ви професійний гірник й піднімаєтеся з друзями на вулка Кіліманжаро ")
score = 0

# -----1-----

print("Одному з ваших друзів стає погано")
choice = input("Що ви зробите? \n 1- Дати ліки \n 2 - Відправити його до підніжя гори з іншими гірниками ")

if choice == "1":
    print("Ви даєте йому ліки")
    score += 10
else:
    print("Відправляєте його до підніжя вулкану з іншими гірниками ")
    score -= 5

# -----2-----

print("Ви дали йому ліки й продовжили свій шлях до ідніжя гори")
print("з часом ви зустрічаєте заблукавшовго гірника з іншої експедиції")
choice = input("Ви доплможете йому? \n 1 - Так, \n 2- Ні ")

if choice == "1":
    print("Слідуючи по карті ви приймаєте рішення відпрвити одного із своїх друзів з ним до підніжя")
    score += 20
else:
    print("Самі ви продовжили шлях на вершину")

# ------3------

print("Через деяки час ви врирішили відпочити")
print("І ваші друзі запропонували вам розкласти міні табірю")
choice = input("Що ви виберете? \n 1 - так \n 2 - ні ")

if choice == "1":
    print("Ви вирішили рокласти табір на ніч")
if choice == "2":
    print("І ви залишаєтесь в таборі")

# -----4------

print("Прийшов час рухатись в перед до вершини")
choice = input("Що ви зробите? \n 1 - Продовжити шлях, \n 2 - Залишитись на деякий час в таборі ")

if choice == "1":
    if random.random() < 0.4:
        print("Продовжуючи шлях один із ваших друзів лаває обидві ноги")
        print("Вам довелось перервати експедицію й всім разом нести його до підніжжя")
    else:
        print("Ви залишили його й продовжили шдях")
        print("Ви всі неслийого але на половині шляху зірвалась лавина")
        exit()

if choice == "2":
    if trevelers == 1:
        print("Ви відважно старалися врятувати життя друга")
        my_team += 1
        trevelers -= 1
    else:
        print("Нажаль ви всі померли ")
        exit()

# ------finish-------
print("Після декількох днів подорожі ви попали в рай чи пекло")
print("Кінець життя")
exit()