# Список подій

events = [
    (1990, "Розпад Союзу РСР"),
    (1969, "Перша посадка людини на Місяць"),
    (1989, "Падіння Берлінської стіни"),
    (2000, "Початок нового тисячоліття"),
    (2012, "Відома дата за пророцтвом майя")
]

# Словник часу
time_dict = {year: event for year, event in events}


# Множина років, які ми хочемо відвідати
years_to_visit = {1969, 1990, 2050}


# Перевірка подій для років, які ми хочемо відвідати
for year in years_to_visit:
    try:
        print(f"У {year} році сталася така подія: {time_dict[year]}")
    except KeyError:
        print(f"Для року {year} відсутні дані у словнику часу.")
        
